src/test/resources/event-monthly-subscription-cancel.json

{
  "events": [
    {
      "id": "2_omy6jgTVawK8qLf2Iuhw",
      "processed": false,
      "created": 1554092668031,
      "type": "subscription.canceled",
      "live": false,
      "data": {
        "id": "c5XWkUQiQSyqrDTHM8J5Kw",
        "subscription": "c5XWkUQiQSyqrDTHM8J5Kw",
        "active": true,
        "state": "canceled",
        "changed": 1554091889618,
        "changedValue": 1554091889618,
        "changedInSeconds": 1554091889,
        "changedDisplay": "4/1/19",
        "live": false,
        "currency": "EUR",
        "account": {
          "id": "MpQe-PVBQnOguo9A_Pz8Dg",
          "account": "MpQe-PVBQnOguo9A_Pz8Dg",
          "contact": {
            "first": "John",
            "last": "Doe",
            "email": "john.doe@gmail.com",
            "company": null,
            "phone": "064444333"
          },
          "language": "en",
          "country": "RS",
          "lookup": {
            "global": "78COFwcHTuuUritKSDj58Q"
          },
          "url": "https://falcon.test.onfastspring.com/account"
        },
        "product": {
          "product": "falcon-plus-monthly-subscription-individual",
          "parent": null,
          "display": {
            "en": "Falcon Plus Monthly Subscription"
          },
          "description": {
            "summary": {
              "en": "Monthly Falcon Plus subscription for individual customers. "
            }
          },
          "image": "https://d8y8nchqlnmka.cloudfront.net/_RvXNGiNQBE/IfubWlm6QXM/falcon-tiger.png",
          "fulfillments": {},
          "format": "digital",
          "pricing": {
            "renew": "auto",
            "interval": "month",
            "intervalLength": 1,
            "intervalCount": null,
            "quantityBehavior": "lock",
            "quantityDefault": 1,
            "price": {
              "USD": 14
            },
            "dateLimitsEnabled": false,
            "reminderNotification": {
              "enabled": true,
              "interval": "week",
              "intervalLength": 1
            },
            "overdueNotification": {
              "enabled": true,
              "interval": "week",
              "intervalLength": 1,
              "amount": 4
            },
            "cancellation": {
              "interval": "week",
              "intervalLength": 1
            }
          }
        },
        "sku": null,
        "display": "Falcon Plus Monthly Subscription",
        "quantity": 1,
        "adhoc": false,
        "autoRenew": true,
        "price": 13,
        "priceDisplay": "€13.00",
        "priceInPayoutCurrency": 14.07,
        "priceInPayoutCurrencyDisplay": "USD 14.07",
        "discount": 0,
        "discountDisplay": "€0.00",
        "discountInPayoutCurrency": 0,
        "discountInPayoutCurrencyDisplay": "USD 0.00",
        "subtotal": 13,
        "subtotalDisplay": "€13.00",
        "subtotalInPayoutCurrency": 14.07,
        "subtotalInPayoutCurrencyDisplay": "USD 14.07",
        "next": 1556668800000,
        "nextValue": 1556668800000,
        "nextInSeconds": 1556668800,
        "nextDisplay": "5/1/19",
        "end": null,
        "endValue": null,
        "endInSeconds": null,
        "endDisplay": null,
        "canceledDate": 1554076800000,
        "canceledDateValue": 1554076800000,
        "canceledDateInSeconds": 1554076800,
        "canceledDateDisplay": "4/1/19",
        "deactivationDate": 1556582400000,
        "deactivationDateValue": 1556582400000,
        "deactivationDateInSeconds": 1556582400,
        "deactivationDateDisplay": "4/30/19",
        "sequence": 1,
        "periods": null,
        "remainingPeriods": null,
        "begin": 1554076800000,
        "beginValue": 1554076800000,
        "beginInSeconds": 1554076800,
        "beginDisplay": "4/1/19",
        "intervalUnit": "month",
        "intervalLength": 1,
        "nextChargeCurrency": "EUR",
        "nextChargeDate": 1556668800000,
        "nextChargeDateValue": 1556668800000,
        "nextChargeDateInSeconds": 1556668800,
        "nextChargeDateDisplay": "5/1/19",
        "nextChargePreTax": 13,
        "nextChargePreTaxDisplay": "€13.00",
        "nextChargePreTaxInPayoutCurrency": 14.07,
        "nextChargePreTaxInPayoutCurrencyDisplay": "USD 14.07",
        "nextChargeTotal": 13,
        "nextChargeTotalDisplay": "€13.00",
        "nextChargeTotalInPayoutCurrency": 14.07,
        "nextChargeTotalInPayoutCurrencyDisplay": "USD 14.07",
        "paymentReminder": {
          "intervalUnit": "week",
          "intervalLength": 1
        },
        "paymentOverdue": {
          "intervalUnit": "week",
          "intervalLength": 1,
          "total": 4,
          "sent": 0
        },
        "cancellationSetting": {
          "cancellation": "AFTER_LAST_NOTIFICATION",
          "intervalUnit": "week",
          "intervalLength": 1
        },
        "instructions": [
          {
            "product": "falcon-plus-monthly-subscription-individual",
            "type": "regular",
            "periodStartDate": null,
            "periodStartDateValue": null,
            "periodStartDateInSeconds": null,
            "periodStartDateDisplay": null,
            "periodEndDate": null,
            "periodEndDateValue": null,
            "periodEndDateInSeconds": null,
            "periodEndDateDisplay": null,
            "intervalUnit": "month",
            "intervalLength": 1,
            "discountPercent": 0,
            "discountPercentValue": 0,
            "discountPercentDisplay": "0%",
            "discountTotal": 0,
            "discountTotalDisplay": "€0.00",
            "discountTotalInPayoutCurrency": 0,
            "discountTotalInPayoutCurrencyDisplay": "USD 0.00",
            "unitDiscount": 0,
            "unitDiscountDisplay": "€0.00",
            "unitDiscountInPayoutCurrency": 0,
            "unitDiscountInPayoutCurrencyDisplay": "USD 0.00",
            "price": 13,
            "priceDisplay": "€13.00",
            "priceInPayoutCurrency": 14.07,
            "priceInPayoutCurrencyDisplay": "USD 14.07",
            "priceTotal": 13,
            "priceTotalDisplay": "€13.00",
            "priceTotalInPayoutCurrency": 14.07,
            "priceTotalInPayoutCurrencyDisplay": "USD 14.07",
            "unitPrice": 13,
            "unitPriceDisplay": "€13.00",
            "unitPriceInPayoutCurrency": 14.07,
            "unitPriceInPayoutCurrencyDisplay": "USD 14.07",
            "total": 13,
            "totalDisplay": "€13.00",
            "totalInPayoutCurrency": 14.07,
            "totalInPayoutCurrencyDisplay": "USD 14.07"
          }
        ]
      }
    }
  ]
}