src/test/resources/event-yearly-subscription-cancel.json

{
  "events": [
    {
      "id": "AJX4HVpXS7aqhWjtuwW1Aw",
      "processed": false,
      "created": 1554092680155,
      "type": "subscription.canceled",
      "live": false,
      "data": {
        "id": "r1LtQnrIS5KpDIoGQaeuHg",
        "subscription": "r1LtQnrIS5KpDIoGQaeuHg",
        "active": true,
        "state": "canceled",
        "changed": 1554090861640,
        "changedValue": 1554090861640,
        "changedInSeconds": 1554090861,
        "changedDisplay": "4/1/19",
        "live": false,
        "currency": "EUR",
        "account": {
          "id": "MpQe-PVBQnOguo9A_Pz8Dg",
          "account": "MpQe-PVBQnOguo9A_Pz8Dg",
          "contact": {
            "first": "John",
            "last": "Doe",
            "email": "john.doe@gmail.com",
            "company": null,
            "phone": "064444333"
          },
          "language": "en",
          "country": "RS",
          "lookup": {
            "global": "78COFwcHTuuUritKSDj58Q"
          },
          "url": "https://falcon.test.onfastspring.com/account"
        },
        "product": {
          "product": "falcon-plus-annual-subscription-individual-license",
          "parent": null,
          "display": {
            "en": "Falcon Plus Annual Subscription"
          },
          "description": {
            "summary": {
              "en": "Annual Falcon Plus subscription for individual customers. "
            }
          },
          "image": "https://d8y8nchqlnmka.cloudfront.net/_RvXNGiNQBE/iNKuvT8uQ6k/falcon-tiger.png",
          "fulfillments": {},
          "format": "digital",
          "pricing": {
            "renew": "auto",
            "interval": "year",
            "intervalLength": 1,
            "intervalCount": null,
            "quantityBehavior": "lock",
            "quantityDefault": 1,
            "price": {
              "USD": 108
            },
            "quantityDiscounts": {
              "1": 100
            },
            "dateLimitsEnabled": false,
            "discountDuration": 1,
            "reminderNotification": {
              "enabled": true,
              "interval": "month",
              "intervalLength": 1
            },
            "overdueNotification": {
              "enabled": true,
              "interval": "week",
              "intervalLength": 1,
              "amount": 4
            },
            "cancellation": {
              "interval": "week",
              "intervalLength": 1
            }
          }
        },
        "sku": null,
        "display": "Falcon Plus Annual Subscription",
        "quantity": 1,
        "adhoc": false,
        "autoRenew": true,
        "price": 100,
        "priceDisplay": "€100.00",
        "priceInPayoutCurrency": 108.26,
        "priceInPayoutCurrencyDisplay": "USD 108.26",
        "discount": 0,
        "discountDisplay": "€0.00",
        "discountInPayoutCurrency": 0,
        "discountInPayoutCurrencyDisplay": "USD 0.00",
        "subtotal": 100,
        "subtotalDisplay": "€100.00",
        "subtotalInPayoutCurrency": 108.26,
        "subtotalInPayoutCurrencyDisplay": "USD 108.26",
        "discountDuration": 0,
        "next": 1585699200000,
        "nextValue": 1585699200000,
        "nextInSeconds": 1585699200,
        "nextDisplay": "4/1/20",
        "end": null,
        "endValue": null,
        "endInSeconds": null,
        "endDisplay": null,
        "canceledDate": 1554076800000,
        "canceledDateValue": 1554076800000,
        "canceledDateInSeconds": 1554076800,
        "canceledDateDisplay": "4/1/19",
        "deactivationDate": 1585612800000,
        "deactivationDateValue": 1585612800000,
        "deactivationDateInSeconds": 1585612800,
        "deactivationDateDisplay": "3/31/20",
        "sequence": 1,
        "periods": null,
        "remainingPeriods": null,
        "begin": 1554076800000,
        "beginValue": 1554076800000,
        "beginInSeconds": 1554076800,
        "beginDisplay": "4/1/19",
        "intervalUnit": "year",
        "intervalLength": 1,
        "nextChargeCurrency": "EUR",
        "nextChargeDate": 1585699200000,
        "nextChargeDateValue": 1585699200000,
        "nextChargeDateInSeconds": 1585699200,
        "nextChargeDateDisplay": "4/1/20",
        "nextChargePreTax": 100,
        "nextChargePreTaxDisplay": "€100.00",
        "nextChargePreTaxInPayoutCurrency": 108.26,
        "nextChargePreTaxInPayoutCurrencyDisplay": "USD 108.26",
        "nextChargeTotal": 100,
        "nextChargeTotalDisplay": "€100.00",
        "nextChargeTotalInPayoutCurrency": 108.26,
        "nextChargeTotalInPayoutCurrencyDisplay": "USD 108.26",
        "paymentReminder": {
          "intervalUnit": "month",
          "intervalLength": 1
        },
        "paymentOverdue": {
          "intervalUnit": "week",
          "intervalLength": 1,
          "total": 4,
          "sent": 0
        },
        "cancellationSetting": {
          "cancellation": "AFTER_LAST_NOTIFICATION",
          "intervalUnit": "week",
          "intervalLength": 1
        },
        "instructions": [
          {
            "product": "falcon-plus-annual-subscription-individual-license",
            "type": "regular",
            "periodStartDate": null,
            "periodStartDateValue": null,
            "periodStartDateInSeconds": null,
            "periodStartDateDisplay": null,
            "periodEndDate": null,
            "periodEndDateValue": null,
            "periodEndDateInSeconds": null,
            "periodEndDateDisplay": null,
            "intervalUnit": "year",
            "intervalLength": 1,
            "discountPercent": 0,
            "discountPercentValue": 0,
            "discountPercentDisplay": "0%",
            "discountTotal": 0,
            "discountTotalDisplay": "€0.00",
            "discountTotalInPayoutCurrency": 0,
            "discountTotalInPayoutCurrencyDisplay": "USD 0.00",
            "unitDiscount": 0,
            "unitDiscountDisplay": "€0.00",
            "unitDiscountInPayoutCurrency": 0,
            "unitDiscountInPayoutCurrencyDisplay": "USD 0.00",
            "price": 100,
            "priceDisplay": "€100.00",
            "priceInPayoutCurrency": 108.26,
            "priceInPayoutCurrencyDisplay": "USD 108.26",
            "priceTotal": 100,
            "priceTotalDisplay": "€100.00",
            "priceTotalInPayoutCurrency": 108.26,
            "priceTotalInPayoutCurrencyDisplay": "USD 108.26",
            "unitPrice": 100,
            "unitPriceDisplay": "€100.00",
            "unitPriceInPayoutCurrency": 108.26,
            "unitPriceInPayoutCurrencyDisplay": "USD 108.26",
            "total": 100,
            "totalDisplay": "€100.00",
            "totalInPayoutCurrency": 108.26,
            "totalInPayoutCurrencyDisplay": "USD 108.26"
          }
        ]
      }
    }
  ]
}